
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://rpts-aat.vault.azure.net/secrets/app-insights-connection-string/a5faaba511d342c0915aa324488b54d1"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T12:43:17Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-DATABASE/7a734a9430384d5e89e7fb31f1149ba9"
        name                    = "api-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T12:43:17Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-HOST/0d328fc5e06d491bb81637e36bd1db2e"
        name                    = "api-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T12:43:17Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PASS/bc00cc5025ec4b44a694fba226f4b866"
        name                    = "api-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T12:43:17Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PORT/065310f686644ab9ac768f6f97bb6b59"
        name                    = "api-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2027-02-24T12:43:17Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-USER/8b501afce82c4f7dbd4c7a95bcab3a94"
        name                    = "api-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "792f2992-1c74-4c14-93a8-304fc3387a7f" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-api-aat/providers/Microsoft.Insights/components/rpts-api-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "uksouth" -> "global" # forces replacement
        name                                  = "rpts-api-appinsights-aat"
        tags                                  = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
        }
        # (12 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "Application Insights daily cap reached - rpts-api-appinsights-aat"
      + resource_group_name = "rpts-api-aat"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "residential-property-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Residential Property Tribunals"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C019U8T8KJS"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

Plan: 2 to add, 6 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":229,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->